src/DataProcessors/expert1cОбработкаЗаявок/expert1cОбработкаЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>expert1cОбработкаЗаявок</name>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПринята</name>
    <type>
      <types>CatalogRef.СтатусЗадачНаВыполнение</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНазначена</name>
    <type>
      <types>CatalogRef.СтатусЗадачНаВыполнение</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/expert1cОбработкаЗаявок/ObjectModule.bsl
// expert1c 03.10.2026 Обработка заявок на выполнение
// Для заявок с заданным исполнителем (отбор) устанавливает вид работ,
// а у заявок в выбранных статусах очищает исполнитель.
//
// Возвращаемое значение:
//  Структура - Обработано, ИсполнительОчищен, Ошибок.
//
Функция ВыполнитьОбработку() Экспорт
	
	Результат = Новый Структура("Обработано, ИсполнительОчищен, Ошибок", 0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заявки.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗаявкаНаВыполнение КАК Заявки
	|ГДЕ
	|	Заявки.Исполнитель = &Исполнитель
	|	И НЕ Заявки.ПометкаУдаления";
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	МассивЗаявок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ПустойИсполнитель = Справочники.Пользователи.ПустаяСсылка();
	
	Для Каждого Заявка Из МассивЗаявок Цикл
		
		Попытка
			ЗаявкаОбъект = Заявка.ПолучитьОбъект();
			Изменена = Ложь;
			
			Если ЗначениеЗаполнено(ВидРабот) И ЗаявкаОбъект.ВидРабот <> ВидРабот Тогда
				ЗаявкаОбъект.ВидРабот = ВидРабот;
				Изменена = Истина;
			КонецЕсли;
			
			Очищать = ЗначениеЗаполнено(ЗаявкаОбъект.Статус)
				И (ЗаявкаОбъект.Статус = СтатусПринята ИЛИ ЗаявкаОбъект.Статус = СтатусНазначена);
			Если Очищать Тогда
				ЗаявкаОбъект.Исполнитель = ПустойИсполнитель;
				Изменена = Истина;
				Результат.ИсполнительОчищен = Результат.ИсполнительОчищен + 1;
			КонецЕсли;
			
			Если Изменена Тогда
				ЗаявкаОбъект.Записать();
				Результат.Обработано = Результат.Обработано + 1;
			КонецЕсли;
		Исключение
			Результат.Ошибок = Результат.Ошибок + 1;
			ЗаписьЖурналаРегистрации("Обработка заявок на выполнение",
				УровеньЖурналаРегистрации.Ошибка, Метаданные.Задачи.ЗаявкаНаВыполнение, Заявка,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
// Конец expert1c
